## Data Inspection & Basic info

In [16]:
import pandas as pd

In [17]:
# 11.  Display first 5 rows: Ek CSV file se data load karein aur uske pehle 5 rows (head) ko display karein.
df = pd.read_csv('file.csv'); df.head()

     Name   Age      City  Salary
0    Alice   25  New York   50000
1      Bob   30    London   60000
2  Charlie   35     Paris   55000
3    David   40  New York   70000
4      Eva   22     Tokyo   65000

In [18]:
# 12. Display last 3 rows: Usi DataFrame ke aakhri 3 rows (tail) ko display karein. 
df.tail(3)

     Name   Age      City  Salary
2  Charlie   35     Paris   55000
3    David   40  New York   70000
4      Eva   22     Tokyo   65000

In [19]:
# 13. Get the shape: DataFrame ka shape (number of rows and columns) pata karein.
df.shape

(5, 4)

In [20]:
# 14. Get column names: DataFrame ke sabhi columns ke naam list karein. 
df.columns.tolist()

['Name ', 'Age', 'City', 'Salary']

In [21]:
# 15. Get the index: DataFrame ka index display karein. 
df.index

RangeIndex(start=0, stop=5, step=1)

In [22]:
# 16. Get data types: Har column ka data type (dtype) pata karein. 
df.dtypes

Name      object
Age        int64
City      object
Salary     int64
dtype: object

In [23]:
# 17. Get DataFrame info: DataFrame ki ek concise summary (non-null values, memory usage, etc.) paane ke liye .info() method ka use karein.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
 3   Salary  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [26]:
# 18. Count unique values: Ek specific column (e.g., 'City') mein unique values ki ginti karein.
df['City'].nunique()

4

In [28]:
# 19. Get unique values: Ek column mein maujood sabhi unique values ko list karein. 
df['Salary'].unique()

array([50000, 60000, 55000, 70000, 65000], dtype=int64)

In [29]:
# 20. Get descriptive statistics: DataFrame ke sabhi numerical columns ke liye descriptive statistics (mean, std, min, max, etc.) generate karein.
df.describe()

             Age       Salary
count   5.000000      5.00000
mean   30.400000  60000.00000
std     7.300685   7905.69415
min    22.000000  50000.00000
25%    25.000000  55000.00000
50%    30.000000  60000.00000
75%    35.000000  65000.00000
max    40.000000  70000.00000